Revit 2027 API
FamilyType.HasValue Method
Indicates if this family parameter has an assigned value or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasValue(
	FamilyParameter familyParameter
)
Public Function HasValue (
	familyParameter As FamilyParameter
) As Boolean
public:
bool HasValue(
	FamilyParameter^ familyParameter
)
member HasValue :
        familyParameter : FamilyParameter -> bool
Parameters
familyParameter FamilyParameter
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input argument-"familyParameter"-is null.
ArgumentException |  Thrown if the input argument-"familyParameter"-is invalid.
See Also
Reference
FamilyType Class
Autodesk.Revit.DB Namespace